#include <stdio.h>

main()
{
	int num1 = 5;        // 00000000 00000000 00000000 00000101
	int num2 = 19;       // 00000000 00000000 00000000 00010011

	// 00000101
	// 00010011 AND
	// -----------
	// 00000001
	int num3 = num1 & num2; // AND

	// 00000101
	// 00010011 OR
	// -----------
	// 00010111 (23)
	int num4 = num1 | num2; // OR

	// 00000101
	// 00010011 XOR
	// -----------
	// 00010110 (22)
	int num5 = num1 ^ num2; // exclusiv-OR

	// 디버그를 이용하여 num3, num4, num5 의 값을 알아본다.

	printf("num3 = %d, num4 = %d, num5 = %d \n\n", num3, num4, num5);

}